In [30]:
import pandas as pd 

tab = pd.read_csv('dados-exem.csv', skiprows= 4, index_col='Country Name')
tab = tab.T
tab.tail()

Country Name,Aruba,Afghanistan,Angola,Albania,Andorra,Arab World,United Arab Emirates,Argentina,Armenia,American Samoa,...,Virgin Islands (U.S.),Vietnam,Vanuatu,World,Samoa,Kosovo,"Yemen, Rep.",South Africa,Zambia,Zimbabwe
2016,26992.202466,514.293114,3323.228602,4191.208225,NaN,6152.541359,38365.825914,12510.542822,3675.323142,NaN,...,NaN,2100.483689,2882.284456,10291.725365,4013.552560,3826.023323,1138.682995,5127.193610,1241.039555,1338.020704
2017,27387.904699,526.726154,3844.088118,4542.867216,NaN,6151.163869,40937.556248,14241.141405,4052.835556,NaN,...,NaN,2198.063364,3044.048624,10832.881215,4123.440163,4127.859725,960.528534,5948.562599,1466.835776,1410.406438
2018,NaN,498.881483,3035.521121,5278.383442,NaN,6609.295739,43987.223039,11215.036881,4294.549371,NaN,...,NaN,2407.402914,3150.258322,11370.120184,4035.580892,4494.408753,823.683629,6172.569944,1492.930760,1572.589521
2019,NaN,515.164559,2554.552842,5282.563763,NaN,6597.715671,43314.012083,9515.387209,4699.729453,NaN,...,NaN,2557.701509,3145.049550,11427.769880,4134.648882,4517.744195,773.905849,5832.192024,1282.634508,1354.401689
Unnamed: 34,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [31]:
# removendo os na/nan
tab.Aruba.dropna() # podendo ser reescrito como # tab.Aruba[tab.Aruba.notnull()]

Country Code                       ABW
Indicator Name    GNI per capita (US$)
Indicator Code       NY.GNP.MKTP.PC.CD
1990                      12182.364223
1991                      13375.837206
1992                      13904.863778
1993                      14690.260202
1994                      15980.290328
1995                      16250.178398
1996                      16371.870971
1997                      17656.432067
1998                      19014.333289
1999                      18876.662192
2000                      20356.291676
2001                      20052.629357
2002                      19008.363421
2003                      20283.261996
2004                      21817.453884
2005                      18514.930763
2006                      22995.369457
2007                      22034.095311
2008                      25933.300638
2009                      23754.924508
2010                      22132.837578
2011                      22566.227937
2012                      23581.781260
2013                      24594.024487
2014                      25656.850141
2015                      26785.295035
2016                      26992.202466
2017                      27387.904699
Name: Aruba, dtype: object

In [32]:
# remove apenas as linhas vazias (na/nan)
tab.dropna(how='all').tail()

Country Name,Aruba,Afghanistan,Angola,Albania,Andorra,Arab World,United Arab Emirates,Argentina,Armenia,American Samoa,...,Virgin Islands (U.S.),Vietnam,Vanuatu,World,Samoa,Kosovo,"Yemen, Rep.",South Africa,Zambia,Zimbabwe
2015,26785.295035,583.695856,3955.121324,3999.379563,NaN,6423.310670,38851.519498,13508.419413,3753.733122,NaN,...,NaN,1978.056618,2810.178701,10276.773769,3990.709868,3660.572587,1550.929256,5592.515426,1311.859067,1301.574534
2016,26992.202466,514.293114,3323.228602,4191.208225,NaN,6152.541359,38365.825914,12510.542822,3675.323142,NaN,...,NaN,2100.483689,2882.284456,10291.725365,4013.552560,3826.023323,1138.682995,5127.193610,1241.039555,1338.020704
2017,27387.904699,526.726154,3844.088118,4542.867216,NaN,6151.163869,40937.556248,14241.141405,4052.835556,NaN,...,NaN,2198.063364,3044.048624,10832.881215,4123.440163,4127.859725,960.528534,5948.562599,1466.835776,1410.406438
2018,NaN,498.881483,3035.521121,5278.383442,NaN,6609.295739,43987.223039,11215.036881,4294.549371,NaN,...,NaN,2407.402914,3150.258322,11370.120184,4035.580892,4494.408753,823.683629,6172.569944,1492.930760,1572.589521
2019,NaN,515.164559,2554.552842,5282.563763,NaN,6597.715671,43314.012083,9515.387209,4699.729453,NaN,...,NaN,2557.701509,3145.049550,11427.769880,4134.648882,4517.744195,773.905849,5832.192024,1282.634508,1354.401689

In [33]:
# para remover apenas as colunas vazias
tab.dropna(axis=1, how='all').tail()

Country Name,Aruba,Afghanistan,Angola,Albania,Andorra,Arab World,United Arab Emirates,Argentina,Armenia,American Samoa,...,Virgin Islands (U.S.),Vietnam,Vanuatu,World,Samoa,Kosovo,"Yemen, Rep.",South Africa,Zambia,Zimbabwe
2016,26992.202466,514.293114,3323.228602,4191.208225,NaN,6152.541359,38365.825914,12510.542822,3675.323142,NaN,...,NaN,2100.483689,2882.284456,10291.725365,4013.552560,3826.023323,1138.682995,5127.193610,1241.039555,1338.020704
2017,27387.904699,526.726154,3844.088118,4542.867216,NaN,6151.163869,40937.556248,14241.141405,4052.835556,NaN,...,NaN,2198.063364,3044.048624,10832.881215,4123.440163,4127.859725,960.528534,5948.562599,1466.835776,1410.406438
2018,NaN,498.881483,3035.521121,5278.383442,NaN,6609.295739,43987.223039,11215.036881,4294.549371,NaN,...,NaN,2407.402914,3150.258322,11370.120184,4035.580892,4494.408753,823.683629,6172.569944,1492.930760,1572.589521
2019,NaN,515.164559,2554.552842,5282.563763,NaN,6597.715671,43314.012083,9515.387209,4699.729453,NaN,...,NaN,2557.701509,3145.049550,11427.769880,4134.648882,4517.744195,773.905849,5832.192024,1282.634508,1354.401689
Unnamed: 34,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [62]:
# selecionando linhas com uma ceta quantidade de observaÃ§Ãµes
import numpy as np 
from numpy import nan as NA

exem = pd.DataFrame(np.random.randn(7, 3))
exem.iloc[(0,2,4,6), 2] = NA
exem.iloc[(1,3,5), 1] = NA
exem.iloc[:2, 0] = NA

print(exem, '\n-------------------------------')

exem.dropna(thresh=2) # permanece apenas linhas com duas observaÃ§Ãµes

          0         1         2
0       NaN -1.782069       NaN
1       NaN       NaN -1.040044
2 -1.166824  1.092271       NaN
3 -0.520168       NaN -0.679283
4 -0.654353  0.471911       NaN
5 -0.034597       NaN -0.640685
6  0.118100 -1.177406       NaN
-------------------------------

          0         1         2
2 -1.166824  1.092271       NaN
3 -0.520168       NaN -0.679283
4 -0.654353  0.471911       NaN
5 -0.034597       NaN -0.640685
6  0.118100 -1.177406       NaN

In [59]:
# preenchendo dados faltantes
print(
exem.fillna(0), # como mesmo valor #outra maneira exem.filna(0,inplace=True)
'\n-------------------------------\n',
exem.fillna({1:0,1:0.5,2:1.5, }) # com cada coluna tendo valores diferens
)

          0         1         2
0  0.000000  0.238143  0.000000
1  0.000000  0.000000 -0.529343
2  0.016471  0.034575  0.000000
3  0.358246  0.000000 -0.296240
4  0.692875  0.415993  0.000000
5  1.193525  0.000000 -0.397192
6  0.568381 -0.711192  0.000000
-------------------------------
           0         1         2
0       NaN  0.238143  1.500000
1       NaN  0.500000 -0.529343
2  0.016471  0.034575  1.500000
3  0.358246  0.500000 -0.296240
4  0.692875  0.415993  1.500000
5  1.193525  0.500000 -0.397192
6  0.568381 -0.711192  1.500000

In [69]:
exem2 = pd.read_csv('exem3.csv', usecols=['Adubo', 'Dose', 'Bloco','y'])
exem2.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
35    False
36    False
37    False
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
dtype: bool

In [80]:
exem2 = exem2.append(exem2[:5]) # duplicando um trecho 
exem2.duplicated() # verificando se existe casos duplicados
exem2.drop_duplicates() # removendo as repetiÃ§Ãµes

    Adubo  Dose  Bloco     y
0       1     1      1  2747
1       1     1      2  2702
2       1     1      3  2671
3       1     1      4  2547
4       1     2      1  2889
5       1     2      2  2731
6       1     2      3  2633
7       1     2      4  2756
8       1     3      1  3578
9       1     3      2  3387
10      1     3      3  3858
11      1     3      4  4284
12      2     1      1  3164
13      2     1      2  2658
14      2     1      3  3600
15      2     1      4  2760
16      2     2      1  3831
17      2     2      2  3049
18      2     2      3  4182
19      2     2      4  3102
20      2     3      1  4107
21      2     3      2  3031
22      2     3      3  3791
23      2     3      4  3547
24      3     1      1  1902
25      3     1      2  1773
26      3     1      3  3440
27      3     1      4  2347
28      3     2      1  2547
29      3     2      2  2642
30      3     2      3  3347
31      3     2      4  2924
32      3     3      1  3364
33      3     3      2  2427
34      3     3      3  4053
35      3     3      4  3111
36      4     1      1  2978
37      4     1      2  2769
38      4     1      3  2640
39      4     1      4  2542
40      4     2      1  3451
41      4     2      2  2258
42      4     2      3  2478
43      4     2      4  2562
44      4     3      1  3742
45      4     3      2  2498
46      4     3      3  3458
47      4     3      4  3076

In [96]:
# divindo pod bin (intervalos)
idade = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [20,30,40,50,60]
gatos = pd.cut(idade, bins) # separando e virando categorica
gatos.codes # cÃ³digo da cateegoria
gatos.categories # vendo os intervalos das categorias

pd.value_counts(gatos) # saida da contagem por intervalo

# add uma nova categoria
nome_intervalo = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(idade, bins, labels= nome_intervalo)
gatos

[NaN, (20.0, 30.0], (20.0, 30.0], (20.0, 30.0], (20.0, 30.0], ..., (30.0, 40.0], NaN, (40.0, 50.0], (40.0, 50.0], (30.0, 40.0]]
Length: 12
Categories (4, interval[int64]): [(20, 30] < (30, 40] < (40, 50] < (50, 60]]

In [105]:
# filtrando
exem2.y[(exem2.y) > 3500] # em uma coluna
exem2[(exem2.y>3500)] # por um coluna no bd todo

    Adubo  Dose  Bloco     y
8       1     3      1  3578
10      1     3      3  3858
11      1     3      4  4284
14      2     1      3  3600
16      2     2      1  3831
18      2     2      3  4182
20      2     3      1  4107
22      2     3      3  3791
23      2     3      4  3547
34      3     3      3  4053
44      4     3      1  3742

In [114]:
# manipulando string
texto = 'abacaxi, melÃ£o, pepino, a, d, r, apfel'
texto.split(', ')

# reescrevendo
lista = [x.strip() for x in texto.split(', ')]
# criando substring
um, dois, tres, quatro, cinco, seis, sete = lista
'::'.join(lista)

'abacaxi::melÃ£o::pepino::a::d::r::apfel'

In [115]:
# comparaÃ§Ã£o de texto
"melÃ£o" in lista

True

In [116]:
'banana' in lista

False